; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	image3 - mode
	infrared2 - mode
	image1 - mode
	spectrograph4 - mode
	spectrograph0 - mode
	GroundStation0 - direction
	Star2 - direction
	Star4 - direction
	GroundStation7 - direction
	GroundStation11 - direction
	Star9 - direction
	Star6 - direction
	Star1 - direction
	Star5 - direction
	GroundStation8 - direction
	Star10 - direction
	GroundStation3 - direction
	Phenomenon12 - direction
	Star13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 spectrograph4)
	(calibration_target instrument0 Star10)
	(supports instrument1 infrared2)
	(supports instrument1 spectrograph0)
	(supports instrument1 spectrograph4)
	(calibration_target instrument1 GroundStation8)
	(calibration_target instrument1 Star1)
	(calibration_target instrument1 Star9)
	(calibration_target instrument1 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation8)
	(supports instrument2 image1)
	(supports instrument2 infrared2)
	(supports instrument2 spectrograph4)
	(calibration_target instrument2 Star1)
	(calibration_target instrument2 Star10)
	(calibration_target instrument2 Star6)
	(supports instrument3 image3)
	(supports instrument3 infrared2)
	(supports instrument3 image1)
	(calibration_target instrument3 Star5)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star1)
	(supports instrument4 image3)
	(supports instrument4 image1)
	(supports instrument4 infrared2)
	(calibration_target instrument4 GroundStation3)
	(calibration_target instrument4 Star10)
	(calibration_target instrument4 GroundStation8)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star13)
)
(:goal (and
	(pointing satellite1 Star6)
	(pointing satellite2 Star4)
	(have_image Phenomenon12 image3)
	(have_image Star13 image3)
	(have_image Star14 spectrograph4)
))

)

; plan
1. (turn_to satellite2 star4 star13)
   deleted: (pointing satellite2 star13)
   added: (pointing satellite2 star4)
   goals met: 1 of 5
2. (turn_to satellite1 star5 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 star5)
   goals met: 1 of 5
3. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 1 of 5
4. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 5
5. (calibrate satellite1 instrument3 star5)
   added: (calibrated instrument3)
   goals met: 1 of 5
6. (calibrate satellite0 instrument1 groundstation8)
   added: (calibrated instrument1)
   goals met: 1 of 5
7. (turn_to satellite0 star14 groundstation8)
   deleted: (pointing satellite0 groundstation8)
   added: (pointing satellite0 star14)
   goals met: 1 of 5
8. (take_image satellite0 star14 instrument1 spectrograph4)
   added: (have_image star14 spectrograph4)
   goals met: 2 of 5
9. (turn_to satellite1 phenomenon12 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 phenomenon12)
   goals met: 2 of 5
10. (take_image satellite1 phenomenon12 instrument3 image3)
   added: (have_image phenomenon12 image3)
   goals met: 3 of 5
11. (turn_to satellite1 star13 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 star13)
   goals met: 3 of 5
12. (take_image satellite1 star13 instrument3 image3)
   added: (have_image star13 image3)
   goals met: 4 of 5
13. (turn_to satellite1 star6 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 star6)
   goals met: 5 of 5
